//#include <iostream>
//#include <cmath>
//using namespace std;
//int main() {
//    setlocale(LC_ALL, "RU");
//    double x, y,r;
//    cout << "Введите данные попадания x и y. \n";
//    cout << "Введите значение x: "; cin >> x;
//    cout << "Введите значение y: "; cin >> y;
    //пункт а 
  /*  if (x <= 0 && x >= -2 && y >= 0 && y <= 1)
        cout << "Точка принадлежит координатам х у "; 
    else
        cout << " Точка не принадлежит";


      */
    // пункт b 
    /*r = pow((pow((x - 0), 2) + pow((y - 0), 2)), 0.5);
    if (r >= -5 and r <= 5 && y > 0)
        cout << "Точка принадлежит координатам x y";
    else
        cout << " Точка не принадлежит";*/


    //пункт c
    /*r = pow((pow((x - 0), 2) + pow((y - 0), 2)), 0.5);
    if (r >= 3 && r <= 6 && x > 0)
        cout << "Точка принадлежит координатам x y";
    else
        cout << " Точка не принадлежит";*/


    //пункт d
    /*if (x>=0  && y>=0  && y<(-2*x+2))
        cout << "Точка принадлежит координатам x y";
    else
        cout << " Точка не принадлежит";

        

    return 0;
}*/