//#include <iostream>
//
//using namespace std;
//
//int main() {
//    setlocale(LC_ALL, "RU");
//    int a, b, c, sr, nomer;
//
//    cout << "Введите первое целое число a: "; cin >> a;
//    
//    cout << "Введите второе целое число b: "; cin >> b;
//    
//    cout << "Введите третье целое число c: "; cin >> c;
//    
//
//    // a) Сумма тех чисел, которые больше 10
//    int sum10 = 0; // добавляем число 0 
//    if (a > 10) { //если а>10 добавляем число к 0. 
//        sum10 += a;
//    }
//    if (b > 10) {
//        sum10 += b;
//    }
//    if (c > 10) {
//        sum10 += c;
//    }
//    cout << "Сумма чисел, больших 10 : " << sum10  << endl;
//
//    // b) Количество четных чисел
//    int ch = 0;
//    if (a % 2 == 0) 
//        ch++;
//    
//    if (b % 2 == 0) 
//        ch++;
//    
//    if (c % 2 == 0) 
//        ch++;
//    
//    cout << "Количество четных чисел: " << ch << endl;
//
//    // c) Среднее из этих чисел 
//    
//    if ((a >= b && a <= c) || (a >= c && a <= b )) 
//        sr = a;                                        // найдем число которое находится между наиб и наим
//    
//    else if ((b >= a && b <= c) || (b >= c && b <= a)) 
//        sr = b;
//    
//    else 
//        sr = c;
//    
//    cout << "Среднее из этих чисел: " << sr <<endl;
//
//    // d) Номер наименьшего из этих чисел
//    int minnum = min({a,b,c}); // Используем min из 3-ех чисел абс
//    
//    if (minnum == a)
//        nomer = 1;
//
//    else if (minnum == b)
//        nomer = 2;
//   
//    
//    else 
//        nomer = 3;
//    
//    std::cout << "Номер наименьшего из этих чисел: " << nomer << endl;
//
//    return 0;
//}